
# 📊 Лабораторная работа №2

## Анализ данных о продажах из CSV-файла

### 📌 Цель работы

Освоить работу с CSV-файлами в Python, научиться:

* читать данные из файла с помощью модуля `csv`
* обрабатывать и преобразовывать типы данных
* выполнять агрегирование данных
* использовать словари для подсчётов
* находить максимальные значения по условию

---

### 📁 Входные данные

Файл `sales.csv` (разделитель — запятая) содержит данные о продажах в следующем формате:

```
дата,товар,количество,цена_за_единицу
2024-01-01,Яблоки,10,50
2024-01-01,Груши,5,60
2024-01-02,Яблоки,7,50
```

Где:

* **дата** — дата продажи
* **товар** — название товара
* **количество** — количество проданных единиц
* **цена_за_единицу** — цена одной единицы товара

---

### 🧮 Задачи

1. Вычислить **общую выручку за каждый день**.
2. Вычислить **общую выручку за весь период**.
3. Определить **самый продаваемый товар по количеству** (за весь период).

---

### 🛠 Используемые инструменты

* Python 3
* Модуль `csv`
* `collections.defaultdict`

---

### 💻 Реализация

```python
import csv
from collections import defaultdict

revenue_by_day = defaultdict(float)
qty_by_product = defaultdict(int)
total_revenue = 0.0

with open("sales.csv", "r", newline="", encoding="utf-8") as csv_file:
    reader = csv.DictReader(csv_file)

    for row in reader:
        day = row["дата"]
        product = row["товар"]

        qty = int(row["количество"])
        price = float(row["цена_за_единицу"])

        revenue = qty * price

        revenue_by_day[day] += revenue
        qty_by_product[product] += qty
        total_revenue += revenue

print("Выручка по дням:")
for day in sorted(revenue_by_day):
    print(f"{day}: {revenue_by_day[day]:.2f}")

print(f"\nОбщая выручка за период: {total_revenue:.2f}")

best_product, best_qty = max(qty_by_product.items(), key=lambda x: x[1])
print(f"\nСамый продаваемый товар: {best_product} (кол-во: {best_qty})")
```

---

### ▶ Пример вывода программы

```
Выручка по дням:
2026-01-01: 40.00
2026-01-02: 49.50
2026-01-03: 34.00

Общая выручка за период: 123.50

Самый продаваемый товар: Яблоки (кол-во: 17)
```

---

### 📊 Результаты работы

В ходе выполнения лабораторной работы были получены навыки:

* работы с файлами в Python
* обработки табличных данных
* использования словарей для накопления значений
* анализа и агрегации данных

---

### 📌 Вывод

В ходе выполнения лабораторной работы №2 была реализована программа для анализа данных о продажах.
Программа успешно вычисляет ежедневную выручку, общую выручку за период и определяет наиболее продаваемый товар.

---
